{
	"skills": {
		"HTML 5": "I began working with HTML in early 2021 after starting my program at Durham. It was here my passion for web development would begin as it was the first time, I felt I had a lot of creative control over an application (especially when combining it with CSS). It was also my first time working with web applications as my only experience prior to this was with console applications. HTML started to motivate me more about what I could do with programming as it was something new I had not yet experienced.",
		"CSS 3": "CSS I began at the same time as HTML. I thoroughly enjoy how much creative control CSS allows you over the way your website looks. There is so much customizability with it and I am positive I do not yet know it all. CSS is what I would have to say got me into wanting to go down the full-stack developer route. Just seeing examples of what I could do made me enjoy an artistic creativity for the first time and led to me choosing web development as my career.",
		"JavaScript": "JavaScript is a language I just began learning at school in 2022 but I started teaching myself bits of it in the middle of 2021. I understood the importance of this language and used it to get around some tedious work expected of us without JavaScript in assignment. My best demonstrations of JavaScript are this website and the project I have linked down below called School Lab. What I like the most about JavaScript is the extra functionality it provides you. It makes it easier to do longer tasks (example being a professor wanting us to do pagination with PHP). Furthermore, the way it adds functionality also aids in how the site looks on the client side. A perfect example of this is how I made the clickable icons at the start of this portfolio. Without JavaScript, the first thing that comes to mind is wrapping the icon in an a tag, but that would lead to the icon being a hyperlink which I do not find as visually pleasing. I still have a long way to go with JavaScript but understand the importance of this language in web dev and am actively improving my skills.",
		"React": "React is a language I just began teaching myself in 2022. I have been taking a Udemy course by Maximilian Schwarzmüller called React- The Complete Guide. My first real experience designing an application with React was in my capstone project which was presented at the 2023 Durham College IT Expo. I worked on the front-end of this full-stack application and my partner handled the back-end (it was built fully in the MERN stack). The project was named Zetflix (parody of Netflix) since it is a video sharing site. You can check it out below!",
		"Node Js": "Node Js is a language I have also begun to teach myself recently. My interest in node lies in my desire to use React and build full-stack applications. I am taking another Udemy course also by Maximilian Schwarzmüller called NodeJS - The Complete Guide. Thus far i am less experienced with Node.js but I have a history in back-end development and believe I will be able to comprehend Node.JS relatively quickly. My first application with Node.js is again my Capstone project presented at the 2023 Durham College IT Expo (linked below). The back-end for this project was mostly handled by my teammate as we wanted to work with sides of development we were less familiar with to complete our skills as we were both aspiring MERN stack developers.",
		"PHP": "PHP is a language that Durham College has made sure its students know a lot about. I started learning it around the same time I learned HTML and CSS as the program relied heavily on it as the server-side language. Our primary focus has been to connect it to the databases we make in SQL to retrieve and insert data. I have learned more advanced methods since then but have not focused on PHP as much independently as I know other languages are often used in industry like Node Js.",
		"Python": "Python is a language I learned right when I started at Durham College. Surprisingly I had not worked with it prior like I know a lot of my peers had, but I thoroughly enjoyed working with it. What interested me the most with python was how important I learned it is in machine learning. Artificial Intelligence is the one area I would say I am interested in along with web development. My plans for this language is to learn how to develop my own machine learning algorithms in the future that I can incorporate into possible web apps.",
		"C/C++/C#": "C is the first language I would say I became the most comfortable with. It is the one I would say I have been using the longest (though technically Java is) and knew the most about before beginning my education. I have learned the different variations of C including C++ and C# which I both heavily prefer to traditional C. C# is the language I see the most potential in from working with ASP.NET Core, WPF applications and the Microsoft Entity/Identity Framework during my time at Durham College. I have however also seen some very powerful uses of C++ and am interested in exploring some more advanced projects like game development within it.",
		"SQL": "I have been working with SQL databases since I began at Durham College. Databases are extremely important as they are how websites stores user information to be displayed as necessary. I have made quite a few databases during my time at Durham College and am currently working on the most difficult one this semester for our Database class. The number one thing I enjoy about databases is that they offer the ability for me to create a personalized user experience for my website that makes it easier and more enjoyable to use.",
		"Java": "The first language I ever learned. I did not explore java heavily until recently, but I have been making basic console applications in Java for nearly 7 years. While I have used Java the longest, I was more comfortable with C programming for a while (now it is most likely HTML, CSS, Js etc.). Recently at Durham College we have began working with Java Server Pages using Apache Tomcat which has given me a knew perspective on what Java can be used for and has me reconsidering if there is more left that I desire to learn with the language."
	}
}
